app/Controllers/Users.php

    public function export_applicants(){
        $applicantion_ids = [];
        foreach (func_get_args() as $param) {
            array_push($applicantion_ids, $param);
        }
        $this->db = db_connect();
        $builder = $this->db->table("job_applications")
            ->select("public_user_info.*, job_applications.created_at AS applied_on, users.email, refbrgy.brgyDesc, refcitymun.citymunDesc, refprovince.provDesc, public_user_misc_info.*, public_user_educational_background.*")
            ->join("public_user_info", "job_applications.applicant_id = public_user_info.user_id", "left")
            ->join("public_user_misc_info", "job_applications.applicant_id = public_user_misc_info.user_id", "left")
            ->join("public_user_educational_background", "job_applications.applicant_id = public_user_educational_background.user_id", "left")
            ->join("users", "users.id = public_user_info.user_id", "left")
            ->join("refbrgy", "refbrgy.id = public_user_info.barangay_id", "left")
            ->join("refcitymun", "refcitymun.citymunCode = refbrgy.citymunCode", "left")
            ->join("refprovince", "refprovince.provCode = refcitymun.provCode", "left")
            ->whereIn('job_applications.id', $applicantion_ids)
            ->where("job_applications.application_status <>", 3);
        $applicant_infos = $builder->get()->getResultArray();
---
SELECT `public_user_info`.*, `job_applications`.`created_at` AS `applied_on`, `users`.`email`, `refbrgy`.`brgyDesc`, `refcitymun`.`citymunDesc`, `refprovince`.`provDesc`, `public_user_misc_info`.*, `public_user_educational_background`.*
FROM `job_applications`
LEFT JOIN `public_user_info` ON `job_applications`.`applicant_id` = `public_user_info`.`user_id`
LEFT JOIN `public_user_misc_info` ON `job_applications`.`applicant_id` = `public_user_misc_info`.`user_id`
LEFT JOIN `public_user_educational_background` ON `job_applications`.`applicant_id` = `public_user_educational_background`.`user_id`
LEFT JOIN `users` ON `users`.`id` = `public_user_info`.`user_id`
LEFT JOIN `refbrgy` ON `refbrgy`.`id` = `public_user_info`.`barangay_id`
LEFT JOIN `refcitymun` ON `refcitymun`.`citymunCode` = `refbrgy`.`citymunCode`
LEFT JOIN `refprovince` ON `refprovince`.`provCode` = `refcitymun`.`provCode`
WHERE `job_applications`.`id` IN ('6')
AND `job_applications`.`application_status` <> 3